'''
    작성일 : 2023년 10월 11일
    작성자 : 컴퓨터 공학부 202395027 임영훈
    설명 : 함수에 일을 시키고 그 값을 받아 오기.
    
    원의 넓이 구하기.
    반지름이 3인 원의 넓이를 구한다.
    반지름 값을 전 달받아 원의 넓이를 구하고, 넓이를 돌려주는 함수를 작성
    
    [알고리즘]
    (함수) area
        1. 반지름 값을 전달받아 매개 변수에 저장한다.
        2. 반지름으로 원의 넓이를 계산한다.
        3. 계산된 넓이를 함수를 호출한 곳으로 돌아간다.
            
    (함수 호출하는 메인)
        1. 반지름을 가지고 함수를 호출한다.
        2. 돌려받은 넓이를 출력한다.
'''
print(":: 리턴값이 있는 함수 (원의 넓이 구하기) ::")

# 함수 선언(생성)
def area(radius) :  # 전달받은 반지름을 매개 변수에 저장
    result = 3.14 * radius**2   # 원의 넓이 계산
    return result   # result값을 호출한 곳으로 돌려준다.

result = area(3) 
pass(f"반지름이 3인 원의 넓이는 {result} 입니다.")